WeiTsaiChen/CC2642_Impedance_3/tirtos/iar/config/configPkg/package/cfg/ble_release_prm4f.c
            /* 
             * Call Text_putLab to write out the label, taking the precision 
             * into account.
             */
            res = xdc_runtime_Text_putLab(lab, pbuf, parse->precis);
            
            /*
             * Set the length to 0 to indicate to 'doPrint' that nothing should
             * be copied from parse.ptr.
             */
            parse->len = 0;
            
            /* Update the minimum width field. */
            parse->width -= res;
            
            found = TRUE;
        }
        
        if (c == 'F') {
            xdc_runtime_Types_Site site;
            
            /* Retrieve the file name string from the argument list */
            site.file = parse->aFlag ? (xdc_Char *) xdc_iargToPtr(va_arg(va, xdc_IArg)) :
                                       (xdc_Char *) va_arg(va, xdc_Char *);
            
            /* Retrieve the line number from the argument list. */
            site.line = parse->aFlag ? (xdc_Int) va_arg(va, xdc_IArg) : 
                                       (xdc_Int) va_arg(va, xdc_Int);
            
            /* 
             * Omit the 'mod' field, set it to 0.
             * '0' is a safe sentinel value - the IDs for named modules are 
             * 0x8000 and higher, and the IDs for unnamed modules go from 0x1
             * to 0x7fff.
             */
            site.mod = 0;
            
            /* 
             * Call putSite to format the file and line number.
             * If a precision was specified, it will be used as the maximum
             * string lengrth.
             */
            res = xdc_runtime_Text_putSite(&site, pbuf, parse->precis);
            
            /*
             * Set the length to 0 to indicate to 'doPrint' that nothing should
             * be copied from parse.ptr.
             */
            parse->len = 0;
       
            /* Update the minimum width field */
            parse->width -= res;
            
            found = TRUE;
        }
        
        if (c == 'S') {
            /* Retrieve the format string from the argument list */
            parse->ptr = parse->aFlag ? 
                (xdc_Char *) xdc_iargToPtr(va_arg(va, xdc_IArg)) :
                (xdc_Char *) va_arg(va, xdc_Char *);
            
            /* Update pva before passing it to doPrint. */
            *pva = va;
            
            /* Perform the recursive format. System_doPrint does not advance
             * the buffer pointer, so it has to be done explicitly.
             */
            res = xdc_runtime_System_doPrint__I(*pbuf, parse->precis, 
                                                parse->ptr, pva, parse->aFlag);

            if (*pbuf) {
                *pbuf += res;
            }
            
            /* Update the temporary variable with any changes to *pva */
            va = *pva;
            
            /*
             * Set the length to 0 to indicate to 'doPrint' that nothing should
             * be copied from parse.ptr
             */
            parse->len = 0;

            /* Update the minimum width field */
            parse->width -= res;
            
            /* Indicate that we were able to interpret the specifier */
            found = TRUE;
        }
        
    }

    if (c == 'f') {
        /* support arguments _after_ optional float support */
        if (parse->aFlag) {
            (void)va_arg(va, xdc_IArg);
        }
        else {
            (void)va_arg(va, double);
        }
    }    

    if (found == FALSE) {
        /* other character (like %) copy to output */
        *(parse->ptr) = c;
        parse->len = 1;
    }

    /*
     * Before returning, we must update the value of pva. We use a label here
     * so that all return points will go through this update.
     * The 'goto end' is here to ensure that there is always a reference to the
     * label (to avoid the compiler complaining). 
     */
    goto end; 
end:
    *pva = va;
    return (res);
}

/*
 * ======== xdc.runtime.Text TEMPLATE ========
 */


/*
 *  ======== xdc_runtime_Text_visitRope__I ========
 *  This function is indirectly called within Text.c through
 *  the visitRopeFxn configuration parameter of xdc.runtime.Text.
 */
void xdc_runtime_Text_visitRope__I(xdc_runtime_Text_RopeId rope,
    xdc_Fxn visFxn, xdc_Ptr visState)
{
    ((xdc_runtime_Text_MatchVisState *)visState)->res = -1;
}


/*
 * ======== ti.sysbios.rom.ROM TEMPLATE ========
 */


/* ROM_ExternFuncPtrs */
#include <xdc/runtime/System.h>
#include <xdc/runtime/Startup.h>
#include <ti/sysbios/family/arm/cc26xx/Timer.h>
#include <ti/sysbios/family/arm/cc26xx/TimestampProvider.h>

typedef struct {
    /*
     *  functions explicitly excluded from the ROM
     */
    xdc_Int (*xdc_runtime_Startup_getState__I)(xdc_runtime_Types_ModuleId);
    xdc_Bool (*xdc_runtime_System_SupportProxy_Module__startupDone__S)(xdc_Void);
    xdc_Void (*xdc_runtime_System_SupportProxy_abort__E)(xdc_CString);
    xdc_Void (*xdc_runtime_System_SupportProxy_exit__E)( xdc_Int);
    xdc_Void (*xdc_runtime_System_SupportProxy_flush__E)(xdc_Void);
    xdc_Void (*xdc_runtime_System_SupportProxy_putch__E)( xdc_Char);
    xdc_Bool (*xdc_runtime_System_SupportProxy_ready__E)(xdc_Void);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_start__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_initDevice__I)(ti_sysbios_family_arm_cc26xx_Timer_Object *);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I)(ti_sysbios_family_arm_cc26xx_Timer_Object *, xdc_UInt32, xdc_Bool);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle, xdc_UInt32);
    xdc_UInt32 (*ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle);
    xdc_UInt64 (*ti_sysbios_family_arm_cc26xx_Timer_getCount64__E)(ti_sysbios_family_arm_cc26xx_Timer_Object *);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E)(xdc_UArg);
    xdc_UInt32 (*ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle, xdc_Bool);
    xdc_UInt32 (*ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E)(xdc_Void);
    xdc_Void (*xdc_runtime_Error_init__E)(xdc_runtime_Error_Block *);
    xdc_Char * (*xdc_runtime_System_formatNum__I)(xdc_Char *, xdc_UInt32, xdc_Int, xdc_Int);
} ROM_ExternFuncPtrs;

/* xdcRomExternFuncsPtr */
#ifdef __ti__sect
#pragma DATA_SECTION(ROM_externFuncPtrs, ".const:ROM_externFuncPtrs");
#endif
#ifdef __IAR_SYSTEMS_ICC__
#pragma location = ".const_ROM_externFuncPtrs"
#endif
#ifdef __GNUC__
#ifndef __TI_COMPILER_VERSION__
const ROM_ExternFuncPtrs ROM_externFuncPtrs __attribute__ ((section(".const_ROM_externFuncPtrs")));
#endif
#endif
const ROM_ExternFuncPtrs ROM_externFuncPtrs = {
    xdc_runtime_Startup_getState__I,
    xdc_runtime_System_SupportProxy_Module__startupDone__S,
    xdc_runtime_System_SupportProxy_abort__E,
    xdc_runtime_System_SupportProxy_exit__E,
    xdc_runtime_System_SupportProxy_flush__E,
    xdc_runtime_System_SupportProxy_putch__E,
    xdc_runtime_System_SupportProxy_ready__E,
    ti_sysbios_family_arm_cc26xx_Timer_start__E,
    ti_sysbios_family_arm_cc26xx_Timer_initDevice__I,
    ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I,
    ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E,
    ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E,
    ti_sysbios_family_arm_cc26xx_Timer_getCount64__E,
    ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E,
    ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E,
    ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E,
    xdc_runtime_Error_init__E,
    xdc_runtime_System_formatNum__I,
};

/* xdcRomExternFuncsPtr */
#ifdef __ti__sect
#pragma DATA_SECTION(xdcRomExternFuncPtr, ".data:xdcRomExternFuncPtr");
#endif
#ifdef __IAR_SYSTEMS_ICC__
#pragma location = ".data_xdcRomExternFuncPtr"
#endif
#ifdef __GNUC__
#ifndef __TI_COMPILER_VERSION__
const ROM_ExternFuncPtrs *xdcRomExternFuncPtr __attribute__ ((section(".data_xdcRomExternFuncPtr")));
#endif
#endif
const ROM_ExternFuncPtrs *xdcRomExternFuncPtr = &ROM_externFuncPtrs;



