WeiTsaiChen/CC2642_Impedance_3/tirtos/iar/config/configPkg/package/cfg/ble_release_prm4f.c
/* Object__sizeof__C */
#pragma location = ".const_ti_sysbios_hal_Hwi_Object__sizeof__C"
__FAR__ const CT__ti_sysbios_hal_Hwi_Object__sizeof ti_sysbios_hal_Hwi_Object__sizeof__C = sizeof(ti_sysbios_hal_Hwi_Object__);

/* Object__table__C */
#pragma location = ".const_ti_sysbios_hal_Hwi_Object__table__C"
__FAR__ const CT__ti_sysbios_hal_Hwi_Object__table ti_sysbios_hal_Hwi_Object__table__C = 0;

/* dispatcherAutoNestingSupport__C */
#pragma location = ".const_ti_sysbios_hal_Hwi_dispatcherAutoNestingSupport__C"
__FAR__ const CT__ti_sysbios_hal_Hwi_dispatcherAutoNestingSupport ti_sysbios_hal_Hwi_dispatcherAutoNestingSupport__C = 1;

/* dispatcherSwiSupport__C */
#pragma location = ".const_ti_sysbios_hal_Hwi_dispatcherSwiSupport__C"
__FAR__ const CT__ti_sysbios_hal_Hwi_dispatcherSwiSupport ti_sysbios_hal_Hwi_dispatcherSwiSupport__C = 1;

/* dispatcherTaskSupport__C */
#pragma location = ".const_ti_sysbios_hal_Hwi_dispatcherTaskSupport__C"
__FAR__ const CT__ti_sysbios_hal_Hwi_dispatcherTaskSupport ti_sysbios_hal_Hwi_dispatcherTaskSupport__C = 1;

/* dispatcherIrpTrackingSupport__C */
#pragma location = ".const_ti_sysbios_hal_Hwi_dispatcherIrpTrackingSupport__C"
__FAR__ const CT__ti_sysbios_hal_Hwi_dispatcherIrpTrackingSupport ti_sysbios_hal_Hwi_dispatcherIrpTrackingSupport__C = 1;

/* E_stackOverflow__C */
#pragma location = ".const_ti_sysbios_hal_Hwi_E_stackOverflow__C"
__FAR__ const CT__ti_sysbios_hal_Hwi_E_stackOverflow ti_sysbios_hal_Hwi_E_stackOverflow__C = (((xdc_runtime_Error_Id)32) << 16 | 0);


/*
 * ======== ti.sysbios.hal.Hwi_HwiProxy INITIALIZERS ========
 */


/*
 * ======== ti.sysbios.heaps.HeapCallback INITIALIZERS ========
 */

/* Object__DESC__C */
__FAR__ const xdc_runtime_Core_ObjDesc ti_sysbios_heaps_HeapCallback_Object__DESC__C;

/* Object__PARAMS__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Object__PARAMS__C"
__FAR__ const ti_sysbios_heaps_HeapCallback_Params ti_sysbios_heaps_HeapCallback_Object__PARAMS__C = {
    sizeof (ti_sysbios_heaps_HeapCallback_Params), /* __size */
    0, /* __self */
    0, /* __fxns */
    (xdc_runtime_IInstance_Params*)&ti_sysbios_heaps_HeapCallback_Object__PARAMS__C.__iprms, /* instance */
    ((xdc_UArg)(0x0)),  /* arg */
    {
        sizeof (xdc_runtime_IInstance_Params), /* __size */
        0,  /* name */
    },  /* instance */
};

/* Module__root__V */
ti_sysbios_heaps_HeapCallback_Module__ ti_sysbios_heaps_HeapCallback_Module__root__V = {
    {&ti_sysbios_heaps_HeapCallback_Module__root__V.link,  /* link.next */
    &ti_sysbios_heaps_HeapCallback_Module__root__V.link},  /* link.prev */
};

/* Object__table__V */
ti_sysbios_heaps_HeapCallback_Object__ ti_sysbios_heaps_HeapCallback_Object__table__V[1] = {
    {/* instance#0 */
        &ti_sysbios_heaps_HeapCallback_Module__FXNS__C,
        ((xdc_UArg)(0x0)),  /* context */
        ((xdc_UArg)(0x1)),  /* arg */
    },
};

/* Module__diagsEnabled__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__diagsEnabled__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__diagsEnabled ti_sysbios_heaps_HeapCallback_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__diagsIncluded__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__diagsIncluded ti_sysbios_heaps_HeapCallback_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__diagsMask__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__diagsMask ti_sysbios_heaps_HeapCallback_Module__diagsMask__C = ((CT__ti_sysbios_heaps_HeapCallback_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__gateObj__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__gateObj ti_sysbios_heaps_HeapCallback_Module__gateObj__C = ((CT__ti_sysbios_heaps_HeapCallback_Module__gateObj)0);

/* Module__gatePrms__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__gatePrms__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__gatePrms ti_sysbios_heaps_HeapCallback_Module__gatePrms__C = ((CT__ti_sysbios_heaps_HeapCallback_Module__gatePrms)0);

/* Module__id__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__id__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__id ti_sysbios_heaps_HeapCallback_Module__id__C = (xdc_Bits16)0x2f;

/* Module__loggerDefined__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__loggerDefined__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerDefined ti_sysbios_heaps_HeapCallback_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__loggerObj__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerObj ti_sysbios_heaps_HeapCallback_Module__loggerObj__C = ((CT__ti_sysbios_heaps_HeapCallback_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__loggerFxn0__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn0 ti_sysbios_heaps_HeapCallback_Module__loggerFxn0__C = ((CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__loggerFxn1__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn1 ti_sysbios_heaps_HeapCallback_Module__loggerFxn1__C = ((CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__loggerFxn2__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn2 ti_sysbios_heaps_HeapCallback_Module__loggerFxn2__C = ((CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__loggerFxn4__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn4 ti_sysbios_heaps_HeapCallback_Module__loggerFxn4__C = ((CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn4)0);

