WeiTsaiChen/CC2642_Impedance_3/tirtos/iar/config/configPkg/package/cfg/ble_release_prm4f.c
/* Module__loggerFxn8__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Module__loggerFxn8__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn8 ti_sysbios_heaps_HeapCallback_Module__loggerFxn8__C = ((CT__ti_sysbios_heaps_HeapCallback_Module__loggerFxn8)0);

/* Object__count__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Object__count__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Object__count ti_sysbios_heaps_HeapCallback_Object__count__C = 1;

/* Object__heap__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Object__heap__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Object__heap ti_sysbios_heaps_HeapCallback_Object__heap__C = 0;

/* Object__sizeof__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Object__sizeof__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Object__sizeof ti_sysbios_heaps_HeapCallback_Object__sizeof__C = sizeof(ti_sysbios_heaps_HeapCallback_Object__);

/* Object__table__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_Object__table__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_Object__table ti_sysbios_heaps_HeapCallback_Object__table__C = ti_sysbios_heaps_HeapCallback_Object__table__V;

/* allocInstFxn__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_allocInstFxn__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_allocInstFxn ti_sysbios_heaps_HeapCallback_allocInstFxn__C = ((CT__ti_sysbios_heaps_HeapCallback_allocInstFxn)((xdc_Fxn)osalHeapAllocFxn));

/* createInstFxn__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_createInstFxn__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_createInstFxn ti_sysbios_heaps_HeapCallback_createInstFxn__C = ((CT__ti_sysbios_heaps_HeapCallback_createInstFxn)((xdc_Fxn)ti_sysbios_heaps_HeapCallback_defaultCreate));

/* deleteInstFxn__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_deleteInstFxn__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_deleteInstFxn ti_sysbios_heaps_HeapCallback_deleteInstFxn__C = ((CT__ti_sysbios_heaps_HeapCallback_deleteInstFxn)((xdc_Fxn)ti_sysbios_heaps_HeapCallback_defaultDelete));

/* freeInstFxn__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_freeInstFxn__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_freeInstFxn ti_sysbios_heaps_HeapCallback_freeInstFxn__C = ((CT__ti_sysbios_heaps_HeapCallback_freeInstFxn)((xdc_Fxn)osalHeapFreeFxn));

/* getStatsInstFxn__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_getStatsInstFxn__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_getStatsInstFxn ti_sysbios_heaps_HeapCallback_getStatsInstFxn__C = ((CT__ti_sysbios_heaps_HeapCallback_getStatsInstFxn)((xdc_Fxn)osalHeapGetStatsFxn));

/* initInstFxn__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_initInstFxn__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_initInstFxn ti_sysbios_heaps_HeapCallback_initInstFxn__C = ((CT__ti_sysbios_heaps_HeapCallback_initInstFxn)((xdc_Fxn)osalHeapInitFxn));

/* isBlockingInstFxn__C */
#pragma location = ".const_ti_sysbios_heaps_HeapCallback_isBlockingInstFxn__C"
__FAR__ const CT__ti_sysbios_heaps_HeapCallback_isBlockingInstFxn ti_sysbios_heaps_HeapCallback_isBlockingInstFxn__C = ((CT__ti_sysbios_heaps_HeapCallback_isBlockingInstFxn)((xdc_Fxn)osalHeapIsBlockingFxn));


/*
 * ======== ti.sysbios.heaps.HeapMem INITIALIZERS ========
 */


/* Object__PARAMS__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Object__PARAMS__C"
__FAR__ const ti_sysbios_heaps_HeapMem_Params ti_sysbios_heaps_HeapMem_Object__PARAMS__C = {
    sizeof (ti_sysbios_heaps_HeapMem_Params), /* __size */
    0, /* __self */
    0, /* __fxns */
    (xdc_runtime_IInstance_Params*)&ti_sysbios_heaps_HeapMem_Object__PARAMS__C.__iprms, /* instance */
    (xdc_SizeT)0x0,  /* minBlockAlign */
    ((xdc_Ptr)(0x0)),  /* buf */
    ((xdc_UArg)(0x0)),  /* size */
    {
        sizeof (xdc_runtime_IInstance_Params), /* __size */
        0,  /* name */
    },  /* instance */
};

/* Module__root__V */
ti_sysbios_heaps_HeapMem_Module__ ti_sysbios_heaps_HeapMem_Module__root__V = {
    {&ti_sysbios_heaps_HeapMem_Module__root__V.link,  /* link.next */
    &ti_sysbios_heaps_HeapMem_Module__root__V.link},  /* link.prev */
};

/* Module__diagsEnabled__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__diagsEnabled__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__diagsEnabled ti_sysbios_heaps_HeapMem_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__diagsIncluded__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__diagsIncluded ti_sysbios_heaps_HeapMem_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__diagsMask__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__diagsMask ti_sysbios_heaps_HeapMem_Module__diagsMask__C = ((CT__ti_sysbios_heaps_HeapMem_Module__diagsMask)0);

/* Module__gatePrms__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__gatePrms__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__gatePrms ti_sysbios_heaps_HeapMem_Module__gatePrms__C = ((CT__ti_sysbios_heaps_HeapMem_Module__gatePrms)0);

/* Module__loggerDefined__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__loggerDefined__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__loggerDefined ti_sysbios_heaps_HeapMem_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__loggerObj__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__loggerObj ti_sysbios_heaps_HeapMem_Module__loggerObj__C = ((CT__ti_sysbios_heaps_HeapMem_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__loggerFxn0__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn0 ti_sysbios_heaps_HeapMem_Module__loggerFxn0__C = ((CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__loggerFxn1__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn1 ti_sysbios_heaps_HeapMem_Module__loggerFxn1__C = ((CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__loggerFxn2__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn2 ti_sysbios_heaps_HeapMem_Module__loggerFxn2__C = ((CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn2)0);

