WeiTsaiChen/CC2642_Impedance_3/tirtos/iar/config/configPkg/package/cfg/ble_release_prm4f.c
/* Module__loggerFxn4__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__loggerFxn4__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn4 ti_sysbios_heaps_HeapMem_Module__loggerFxn4__C = ((CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Module__loggerFxn8__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn8 ti_sysbios_heaps_HeapMem_Module__loggerFxn8__C = ((CT__ti_sysbios_heaps_HeapMem_Module__loggerFxn8)0);

/* Object__heap__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Object__heap__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Object__heap ti_sysbios_heaps_HeapMem_Object__heap__C = 0;

/* Object__sizeof__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_Object__sizeof__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_Object__sizeof ti_sysbios_heaps_HeapMem_Object__sizeof__C = sizeof(ti_sysbios_heaps_HeapMem_Object__);

/* A_zeroBlock__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_A_zeroBlock__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_A_zeroBlock ti_sysbios_heaps_HeapMem_A_zeroBlock__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_heapSize__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_A_heapSize__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_A_heapSize ti_sysbios_heaps_HeapMem_A_heapSize__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_align__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_A_align__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_A_align ti_sysbios_heaps_HeapMem_A_align__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_invalidFree__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_A_invalidFree__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_A_invalidFree ti_sysbios_heaps_HeapMem_A_invalidFree__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* primaryHeapBaseAddr__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_primaryHeapBaseAddr__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_primaryHeapBaseAddr ti_sysbios_heaps_HeapMem_primaryHeapBaseAddr__C = ((CT__ti_sysbios_heaps_HeapMem_primaryHeapBaseAddr)0);

/* primaryHeapEndAddr__C */
#pragma location = ".const_ti_sysbios_heaps_HeapMem_primaryHeapEndAddr__C"
__FAR__ const CT__ti_sysbios_heaps_HeapMem_primaryHeapEndAddr ti_sysbios_heaps_HeapMem_primaryHeapEndAddr__C = ((CT__ti_sysbios_heaps_HeapMem_primaryHeapEndAddr)0);


/*
 * ======== ti.sysbios.heaps.HeapMem_Module_GateProxy INITIALIZERS ========
 */


/*
 * ======== ti.sysbios.heaps.HeapTrack INITIALIZERS ========
 */


/* Object__PARAMS__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Object__PARAMS__C"
__FAR__ const ti_sysbios_heaps_HeapTrack_Params ti_sysbios_heaps_HeapTrack_Object__PARAMS__C = {
    sizeof (ti_sysbios_heaps_HeapTrack_Params), /* __size */
    0, /* __self */
    0, /* __fxns */
    (xdc_runtime_IInstance_Params*)&ti_sysbios_heaps_HeapTrack_Object__PARAMS__C.__iprms, /* instance */
    0,  /* heap */
    {
        sizeof (xdc_runtime_IInstance_Params), /* __size */
        0,  /* name */
    },  /* instance */
};

/* Module__root__V */
ti_sysbios_heaps_HeapTrack_Module__ ti_sysbios_heaps_HeapTrack_Module__root__V = {
    {&ti_sysbios_heaps_HeapTrack_Module__root__V.link,  /* link.next */
    &ti_sysbios_heaps_HeapTrack_Module__root__V.link},  /* link.prev */
};

/* Module__diagsEnabled__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__diagsEnabled__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__diagsEnabled ti_sysbios_heaps_HeapTrack_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__diagsIncluded__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__diagsIncluded ti_sysbios_heaps_HeapTrack_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__diagsMask__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__diagsMask ti_sysbios_heaps_HeapTrack_Module__diagsMask__C = ((CT__ti_sysbios_heaps_HeapTrack_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__gateObj__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__gateObj ti_sysbios_heaps_HeapTrack_Module__gateObj__C = ((CT__ti_sysbios_heaps_HeapTrack_Module__gateObj)0);

/* Module__gatePrms__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__gatePrms__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__gatePrms ti_sysbios_heaps_HeapTrack_Module__gatePrms__C = ((CT__ti_sysbios_heaps_HeapTrack_Module__gatePrms)0);

/* Module__loggerDefined__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__loggerDefined__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__loggerDefined ti_sysbios_heaps_HeapTrack_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__loggerObj__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__loggerObj ti_sysbios_heaps_HeapTrack_Module__loggerObj__C = ((CT__ti_sysbios_heaps_HeapTrack_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__loggerFxn0__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn0 ti_sysbios_heaps_HeapTrack_Module__loggerFxn0__C = ((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__loggerFxn1__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn1 ti_sysbios_heaps_HeapTrack_Module__loggerFxn1__C = ((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__loggerFxn2__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn2 ti_sysbios_heaps_HeapTrack_Module__loggerFxn2__C = ((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
#pragma location = ".const_ti_sysbios_heaps_HeapTrack_Module__loggerFxn4__C"
__FAR__ const CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn4 ti_sysbios_heaps_HeapTrack_Module__loggerFxn4__C = ((CT__ti_sysbios_heaps_HeapTrack_Module__loggerFxn4)0);

