WeiTsaiChen/CC2642_Impedance_3/tirtos/iar/config/configPkg/package/cfg/ble_release_prm4f.c
/* A_badThreadType__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_badThreadType__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_badThreadType ti_sysbios_knl_Task_A_badThreadType__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_badTaskState__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_badTaskState__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_badTaskState ti_sysbios_knl_Task_A_badTaskState__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_noPendElem__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_noPendElem__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_noPendElem ti_sysbios_knl_Task_A_noPendElem__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_taskDisabled__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_taskDisabled__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_taskDisabled ti_sysbios_knl_Task_A_taskDisabled__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_badPriority__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_badPriority__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_badPriority ti_sysbios_knl_Task_A_badPriority__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_badTimeout__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_badTimeout__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_badTimeout ti_sysbios_knl_Task_A_badTimeout__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_badAffinity__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_badAffinity__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_badAffinity ti_sysbios_knl_Task_A_badAffinity__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_sleepTaskDisabled__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_sleepTaskDisabled__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_sleepTaskDisabled ti_sysbios_knl_Task_A_sleepTaskDisabled__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* A_invalidCoreId__C */
#pragma location = ".const_ti_sysbios_knl_Task_A_invalidCoreId__C"
__FAR__ const CT__ti_sysbios_knl_Task_A_invalidCoreId ti_sysbios_knl_Task_A_invalidCoreId__C = (((xdc_runtime_Assert_Id)0) << 16 | 16);

/* numPriorities__C */
#pragma location = ".const_ti_sysbios_knl_Task_numPriorities__C"
__FAR__ const CT__ti_sysbios_knl_Task_numPriorities ti_sysbios_knl_Task_numPriorities__C = (xdc_UInt)0x6;

/* checkStackFlag__C */
#pragma location = ".const_ti_sysbios_knl_Task_checkStackFlag__C"
__FAR__ const CT__ti_sysbios_knl_Task_checkStackFlag ti_sysbios_knl_Task_checkStackFlag__C = 0;

/* deleteTerminatedTasks__C */
#pragma location = ".const_ti_sysbios_knl_Task_deleteTerminatedTasks__C"
__FAR__ const CT__ti_sysbios_knl_Task_deleteTerminatedTasks ti_sysbios_knl_Task_deleteTerminatedTasks__C = 0;

/* hooks__C */
#pragma location = ".const_ti_sysbios_knl_Task_hooks__C"
__FAR__ const CT__ti_sysbios_knl_Task_hooks ti_sysbios_knl_Task_hooks__C = {0, 0};

/* moduleStateCheckFxn__C */
#pragma location = ".const_ti_sysbios_knl_Task_moduleStateCheckFxn__C"
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckFxn ti_sysbios_knl_Task_moduleStateCheckFxn__C = ((CT__ti_sysbios_knl_Task_moduleStateCheckFxn)((xdc_Fxn)ti_sysbios_knl_Task_moduleStateCheck__I));

/* moduleStateCheckValueFxn__C */
#pragma location = ".const_ti_sysbios_knl_Task_moduleStateCheckValueFxn__C"
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckValueFxn ti_sysbios_knl_Task_moduleStateCheckValueFxn__C = ((CT__ti_sysbios_knl_Task_moduleStateCheckValueFxn)((xdc_Fxn)ti_sysbios_knl_Task_getModuleStateCheckValue__I));

/* moduleStateCheckFlag__C */
#pragma location = ".const_ti_sysbios_knl_Task_moduleStateCheckFlag__C"
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckFlag ti_sysbios_knl_Task_moduleStateCheckFlag__C = 0;

/* objectCheckFxn__C */
#pragma location = ".const_ti_sysbios_knl_Task_objectCheckFxn__C"
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckFxn ti_sysbios_knl_Task_objectCheckFxn__C = ((CT__ti_sysbios_knl_Task_objectCheckFxn)((xdc_Fxn)ti_sysbios_knl_Task_objectCheck__I));

/* objectCheckValueFxn__C */
#pragma location = ".const_ti_sysbios_knl_Task_objectCheckValueFxn__C"
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckValueFxn ti_sysbios_knl_Task_objectCheckValueFxn__C = ((CT__ti_sysbios_knl_Task_objectCheckValueFxn)((xdc_Fxn)ti_sysbios_knl_Task_getObjectCheckValue__I));

/* objectCheckFlag__C */
#pragma location = ".const_ti_sysbios_knl_Task_objectCheckFlag__C"
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckFlag ti_sysbios_knl_Task_objectCheckFlag__C = 0;

/* startupHookFunc__C */
#pragma location = ".const_ti_sysbios_knl_Task_startupHookFunc__C"
__FAR__ const CT__ti_sysbios_knl_Task_startupHookFunc ti_sysbios_knl_Task_startupHookFunc__C = ((CT__ti_sysbios_knl_Task_startupHookFunc)0);


/*
 * ======== ti.sysbios.knl.Task_SupportProxy INITIALIZERS ========
 */


/*
 * ======== ti.sysbios.rom.cortexm.cc26xx.cc26x2v2.CC26xx INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsEnabled__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj)0);

