WeiTsaiChen/CC2642_Impedance_3/tirtos/iar/config/configPkg/package/cfg/ble_release_prm4f.c
/* Module__gatePrms__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms)0);

/* Module__id__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id__C = (xdc_Bits16)0x18;

/* Module__loggerDefined__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn4__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn4__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn8__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn8__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn8)0);

/* Object__count__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__count__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__count ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__count__C = 0;

/* Object__heap__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__heap__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__heap ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__heap__C = 0;

/* Object__sizeof__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__sizeof__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__sizeof ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__sizeof__C = 0;

/* Object__table__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__table__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__table ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Object__table__C = 0;

/* REVISION__C */
#pragma location = ".const_ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_REVISION__C"
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_REVISION ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_REVISION__C = (xdc_UInt32)0x11141955;


/*
 * ======== xdc.runtime.Assert INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
#pragma location = ".const_xdc_runtime_Assert_Module__diagsEnabled__C"
__FAR__ const CT__xdc_runtime_Assert_Module__diagsEnabled xdc_runtime_Assert_Module__diagsEnabled__C = (xdc_Bits32)0x10;

/* Module__diagsIncluded__C */
#pragma location = ".const_xdc_runtime_Assert_Module__diagsIncluded__C"
__FAR__ const CT__xdc_runtime_Assert_Module__diagsIncluded xdc_runtime_Assert_Module__diagsIncluded__C = (xdc_Bits32)0x10;

/* Module__diagsMask__C */
#pragma location = ".const_xdc_runtime_Assert_Module__diagsMask__C"
__FAR__ const CT__xdc_runtime_Assert_Module__diagsMask xdc_runtime_Assert_Module__diagsMask__C = ((CT__xdc_runtime_Assert_Module__diagsMask)0);

/* Module__gateObj__C */
#pragma location = ".const_xdc_runtime_Assert_Module__gateObj__C"
__FAR__ const CT__xdc_runtime_Assert_Module__gateObj xdc_runtime_Assert_Module__gateObj__C = ((CT__xdc_runtime_Assert_Module__gateObj)0);

/* Module__gatePrms__C */
#pragma location = ".const_xdc_runtime_Assert_Module__gatePrms__C"
__FAR__ const CT__xdc_runtime_Assert_Module__gatePrms xdc_runtime_Assert_Module__gatePrms__C = ((CT__xdc_runtime_Assert_Module__gatePrms)0);

/* Module__id__C */
#pragma location = ".const_xdc_runtime_Assert_Module__id__C"
__FAR__ const CT__xdc_runtime_Assert_Module__id xdc_runtime_Assert_Module__id__C = (xdc_Bits16)0x1;

/* Module__loggerDefined__C */
#pragma location = ".const_xdc_runtime_Assert_Module__loggerDefined__C"
__FAR__ const CT__xdc_runtime_Assert_Module__loggerDefined xdc_runtime_Assert_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma location = ".const_xdc_runtime_Assert_Module__loggerObj__C"
__FAR__ const CT__xdc_runtime_Assert_Module__loggerObj xdc_runtime_Assert_Module__loggerObj__C = ((CT__xdc_runtime_Assert_Module__loggerObj)0);

/* Module__loggerFxn0__C */
#pragma location = ".const_xdc_runtime_Assert_Module__loggerFxn0__C"
__FAR__ const CT__xdc_runtime_Assert_Module__loggerFxn0 xdc_runtime_Assert_Module__loggerFxn0__C = ((CT__xdc_runtime_Assert_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
#pragma location = ".const_xdc_runtime_Assert_Module__loggerFxn1__C"
__FAR__ const CT__xdc_runtime_Assert_Module__loggerFxn1 xdc_runtime_Assert_Module__loggerFxn1__C = ((CT__xdc_runtime_Assert_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
#pragma location = ".const_xdc_runtime_Assert_Module__loggerFxn2__C"
__FAR__ const CT__xdc_runtime_Assert_Module__loggerFxn2 xdc_runtime_Assert_Module__loggerFxn2__C = ((CT__xdc_runtime_Assert_Module__loggerFxn2)0);

