WeiTsaiChen/CC2642_Impedance_3/tirtos/iar/config/configPkg/package/cfg/ble_release_prm4f.c
/* ROM_constStruct */
#pragma location = ".const_ROM_constStruct"
__FAR__ const CT__constStruct ROM_constStruct = {
    xdc_runtime_Error_UNWIND, /* xdc_runtime_Error_policy__R */
    {0}, /* xdc_runtime_IModule_Interface__BASE__R */
    {0, 0}, /* xdc_runtime_Startup_lastFxns__R */
    {
        (xdc_CPtr)-1, /* fxnTab */
        &ti_sysbios_knl_Event_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_knl_Event___S1) - sizeof(ti_sysbios_knl_Event_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_knl_Event_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_knl_Event_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_knl_Event_Params), /* prmsSize */
    }, /* ti_sysbios_knl_Event_Object__DESC__R */
    ((CT__ti_sysbios_family_arm_m3_Hwi_excHookFuncs)ti_sysbios_family_arm_m3_Hwi_excHookFuncs__A), /* ti_sysbios_family_arm_m3_Hwi_excHookFuncs__R */
    {
        (xdc_CPtr)&ti_sysbios_gates_GateMutex_Module__FXNS__C, /* fxnTab */
        &ti_sysbios_gates_GateMutex_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_gates_GateMutex___S1) - sizeof(ti_sysbios_gates_GateMutex_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_gates_GateMutex_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_gates_GateMutex_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_gates_GateMutex_Params), /* prmsSize */
    }, /* ti_sysbios_gates_GateMutex_Object__DESC__R */
    ((CT__xdc_runtime_Startup_execImpl)((xdc_Fxn)xdc_runtime_Startup_exec__I)), /* xdc_runtime_Startup_execImpl__R */
    offsetof(ti_sysbios_gates_GateMutex_Object__,Object_field_sem), /* ti_sysbios_gates_GateMutex_Instance_State_sem__O */
    {
        &xdc_runtime_IHeap_Interface__BASE__C, /* __base */
        &ti_sysbios_heaps_HeapTrack_Module__FXNS__C.__sfxns, /* __sysp */
        ti_sysbios_heaps_HeapTrack_alloc__E,
        ti_sysbios_heaps_HeapTrack_free__E,
        ti_sysbios_heaps_HeapTrack_isBlocking__E,
        ti_sysbios_heaps_HeapTrack_getStats__E,
        {
            ti_sysbios_heaps_HeapTrack_Object__create__S,
            ti_sysbios_heaps_HeapTrack_Object__delete__S,
            ti_sysbios_heaps_HeapTrack_Handle__label__S,
            0x2e, /* __mid */
        } /* __sfxns */
    }, /* ti_sysbios_heaps_HeapTrack_Module__FXNS__R */
    1, /* ti_sysbios_knl_Swi_Object__count__R */
    {1, ((__T1_ti_sysbios_knl_Idle_funcList *)ti_sysbios_knl_Idle_funcList__A)}, /* ti_sysbios_knl_Idle_funcList__R */
    0, /* xdc_runtime_Text_isLoaded__R */
    {
        (xdc_CPtr)-1, /* fxnTab */
        &ti_sysbios_knl_Clock_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_knl_Clock___S1) - sizeof(ti_sysbios_knl_Clock_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_knl_Clock_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_knl_Clock_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_knl_Clock_Params), /* prmsSize */
    }, /* ti_sysbios_knl_Clock_Object__DESC__R */
    (xdc_Bits16)0x21, /* ti_sysbios_knl_Task_Module__id__R */
    offsetof(ti_sysbios_knl_Mailbox_Object__,Object_field_dataQue), /* ti_sysbios_knl_Mailbox_Instance_State_dataQue__O */
    ((CT__ti_sysbios_knl_Semaphore_eventSync)0), /* ti_sysbios_knl_Semaphore_eventSync__R */
    {
        &xdc_runtime_IGateProvider_Interface__BASE__C, /* __base */
        &ti_sysbios_gates_GateMutex_Module__FXNS__C.__sfxns, /* __sysp */
        ti_sysbios_gates_GateMutex_query__E,
        ti_sysbios_gates_GateMutex_enter__E,
        ti_sysbios_gates_GateMutex_leave__E,
        {
            ti_sysbios_gates_GateMutex_Object__create__S,
            ti_sysbios_gates_GateMutex_Object__delete__S,
            ti_sysbios_gates_GateMutex_Handle__label__S,
            0x33, /* __mid */
        } /* __sfxns */
    }, /* ti_sysbios_gates_GateMutex_Module__FXNS__R */
    offsetof(ti_sysbios_knl_Task_Module_State__,Object_field_inactiveQ), /* ti_sysbios_knl_Task_Module_State_inactiveQ__O */
    (xdc_Bits16)0x25, /* ti_sysbios_family_arm_m3_Hwi_Module__id__R */
    (xdc_Bits16)0x29, /* ti_sysbios_family_arm_cc26xx_Timer_Module__id__R */
    0, /* ti_sysbios_knl_Mailbox_Object__table__R */
    ti_sysbios_family_arm_m3_Hwi_Object__table__V, /* ti_sysbios_family_arm_m3_Hwi_Object__table__R */
    {
        (xdc_CPtr)-1, /* fxnTab */
        &ti_sysbios_knl_Swi_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_knl_Swi___S1) - sizeof(ti_sysbios_knl_Swi_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_knl_Swi_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_knl_Swi_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_knl_Swi_Params), /* prmsSize */
    }, /* ti_sysbios_knl_Swi_Object__DESC__R */
    (xdc_Int16)0x1, /* xdc_runtime_Text_charCnt__R */
    (((xdc_runtime_Assert_Id)0) << 16 | 16), /* ti_sysbios_heaps_HeapTrack_A_bufOverflow__R */
    0, /* ti_sysbios_heaps_HeapMem_Object__table__R */
    ((CT__ti_sysbios_family_arm_cc26xx_Timer_funcHookCH1)0), /* ti_sysbios_family_arm_cc26xx_Timer_funcHookCH1__R */
    ((CT__xdc_runtime_Error_policyFxn)((xdc_Fxn)xdc_runtime_Error_policySpin__E)), /* xdc_runtime_Error_policyFxn__R */
    (((xdc_runtime_Error_Id)25) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_reserved__R */
    (((xdc_runtime_Assert_Id)0) << 16 | 16), /* ti_sysbios_heaps_HeapTrack_A_notEmpty__R */
    {4, ((__T1_xdc_runtime_Startup_firstFxns *)xdc_runtime_Startup_firstFxns__A)}, /* xdc_runtime_Startup_firstFxns__R */
    ((CT__xdc_runtime_Text_charTab)xdc_runtime_Text_charTab__A), /* xdc_runtime_Text_charTab__R */
    (xdc_UInt)0x8, /* ti_sysbios_family_arm_m3_TaskSupport_stackAlignment__R */
    (xdc_Int)0x36, /* ti_sysbios_family_arm_m3_Hwi_NUM_INTERRUPTS__R */
    (ti_sysbios_knl_Clock_Handle)&ti_sysbios_knl_Clock_Object__table__V[0], /* ti_sysbios_knl_Clock_triggerClock__R */
    ti_sysbios_knl_Swi_Object__table__V, /* ti_sysbios_knl_Swi_Object__table__R */
    (xdc_Bits16)0x9, /* xdc_runtime_Memory_Module__id__R */
    (xdc_Bits16)0x20, /* ti_sysbios_knl_Swi_Module__id__R */
    ((CT__xdc_runtime_SysCallback_flushFxn)((xdc_Fxn)xdc_runtime_SysCallback_defaultFlush)), /* xdc_runtime_SysCallback_flushFxn__R */
    ((CT__ti_sysbios_heaps_HeapMem_Module__gateObj)((const void*)(xdc_runtime_IGateProvider_Handle)&ti_sysbios_gates_GateMutex_Object__table__V[0])), /* ti_sysbios_heaps_HeapMem_Module__gateObj__R */
    (xdc_UInt)0x1, /* ti_sysbios_family_arm_cc26xx_Timer_startupNeeded__R */
    (((xdc_runtime_Error_Id)17) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_noIsr__R */
    {
        (xdc_CPtr)-1, /* fxnTab */
        &ti_sysbios_knl_Queue_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_knl_Queue___S1) - sizeof(ti_sysbios_knl_Queue_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_knl_Queue_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_knl_Queue_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_knl_Queue_Params), /* prmsSize */
    }, /* ti_sysbios_knl_Queue_Object__DESC__R */
    ((CT__ti_sysbios_family_arm_cc26xx_Timer_funcHookCH2)0), /* ti_sysbios_family_arm_cc26xx_Timer_funcHookCH2__R */
    (((xdc_runtime_Error_Id)18) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_NMI__R */
    {
        (xdc_CPtr)-1, /* fxnTab */
        &ti_sysbios_knl_Task_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_knl_Task___S1) - sizeof(ti_sysbios_knl_Task_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_knl_Task_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_knl_Task_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_knl_Task_Params), /* prmsSize */
    }, /* ti_sysbios_knl_Task_Object__DESC__R */
    (((xdc_runtime_Error_Id)1) << 16 | 0), /* xdc_runtime_Assert_E_assertFailed__R */
    (xdc_Bits16)0x31, /* ti_sysbios_gates_GateHwi_Module__id__R */
    {&xdc_runtime_IModule_Interface__BASE__C}, /* xdc_runtime_IHeap_Interface__BASE__R */
    ((CT__xdc_runtime_SysCallback_exitFxn)((xdc_Fxn)xdc_runtime_SysCallback_defaultExit)), /* xdc_runtime_SysCallback_exitFxn__R */
    (xdc_Bits16)0x2d, /* ti_sysbios_heaps_HeapMem_Module__id__R */
    ((CT__ti_sysbios_family_arm_m3_Hwi_excHandlerFunc)0), /* ti_sysbios_family_arm_m3_Hwi_excHandlerFunc__R */
    {
        &xdc_runtime_IHeap_Interface__BASE__C, /* __base */
        &ti_sysbios_heaps_HeapMem_Module__FXNS__C.__sfxns, /* __sysp */
        ti_sysbios_heaps_HeapMem_alloc__E,
        ti_sysbios_heaps_HeapMem_free__E,
        ti_sysbios_heaps_HeapMem_isBlocking__E,
        ti_sysbios_heaps_HeapMem_getStats__E,
        {
            ti_sysbios_heaps_HeapMem_Object__create__S,
            ti_sysbios_heaps_HeapMem_Object__delete__S,
            ti_sysbios_heaps_HeapMem_Handle__label__S,
            0x2d, /* __mid */
        } /* __sfxns */
    }, /* ti_sysbios_heaps_HeapMem_Module__FXNS__R */
    (((xdc_runtime_Error_Id)21) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_busFault__R */
    (xdc_Int)0x0, /* xdc_runtime_System_maxAtexitHandlers__R */
    0, /* ti_sysbios_knl_Queue_Object__count__R */
    (xdc_UInt16)0x7fff, /* xdc_runtime_Text_registryModsLastId__R */
    ti_sysbios_knl_Task_Object__table__V, /* ti_sysbios_knl_Task_Object__table__R */
    {
        (xdc_CPtr)-1, /* fxnTab */
        &ti_sysbios_knl_Mailbox_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_knl_Mailbox___S1) - sizeof(ti_sysbios_knl_Mailbox_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_knl_Mailbox_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_knl_Mailbox_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_knl_Mailbox_Params), /* prmsSize */
    }, /* ti_sysbios_knl_Mailbox_Object__DESC__R */
    ((CT__ti_sysbios_family_arm_m3_Hwi_nullIsrFunc)((xdc_Fxn)ti_sysbios_family_arm_m3_Hwi_excHandlerAsm__I)), /* ti_sysbios_family_arm_m3_Hwi_nullIsrFunc__R */
    ti_sysbios_knl_Clock_TickMode_DYNAMIC, /* ti_sysbios_knl_Clock_tickMode__R */
    (xdc_Bits16)0x33, /* ti_sysbios_gates_GateMutex_Module__id__R */
    (xdc_UInt)0x6, /* ti_sysbios_knl_Swi_numPriorities__R */
    (xdc_UInt)0x0, /* ti_sysbios_knl_Task_numConstructedTasks__R */
    (xdc_Int)0x20, /* xdc_runtime_Startup_maxPasses__R */
    1, /* ti_sysbios_knl_Task_initStackFlag__R */
    ((CT__xdc_runtime_System_abortFxn)((xdc_Fxn)xdc_runtime_System_abortSpin__E)), /* xdc_runtime_System_abortFxn__R */
    offsetof(ti_sysbios_knl_Mailbox_Object__,Object_field_dataSem), /* ti_sysbios_knl_Mailbox_Instance_State_dataSem__O */
    {
        &xdc_runtime_IGateProvider_Interface__BASE__C, /* __base */
        &ti_sysbios_gates_GateHwi_Module__FXNS__C.__sfxns, /* __sysp */
        ti_sysbios_gates_GateHwi_query__E,
        ti_sysbios_gates_GateHwi_enter__E,
        ti_sysbios_gates_GateHwi_leave__E,
        {
            ti_sysbios_gates_GateHwi_Object__create__S,
            ti_sysbios_gates_GateHwi_Object__delete__S,
            ti_sysbios_gates_GateHwi_Handle__label__S,
            0x31, /* __mid */
        } /* __sfxns */
    }, /* ti_sysbios_gates_GateHwi_Module__FXNS__R */
    {
        (xdc_CPtr)0, /* fxnTab */
        &ti_sysbios_hal_Hwi_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_hal_Hwi___S1) - sizeof(ti_sysbios_hal_Hwi_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_hal_Hwi_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_hal_Hwi_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_hal_Hwi_Params), /* prmsSize */
    }, /* ti_sysbios_hal_Hwi_Object__DESC__R */
    (xdc_UInt)0x0, /* ti_sysbios_family_arm_m3_Hwi_priGroup__R */
    (((xdc_runtime_Error_Id)3) << 16 | 0), /* xdc_runtime_Error_E_memory__R */
    (((xdc_runtime_Error_Id)14) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_alreadyDefined__R */
    offsetof(ti_sysbios_knl_Mailbox_Object__,Object_field_freeSem), /* ti_sysbios_knl_Mailbox_Instance_State_freeSem__O */
    0, /* ti_sysbios_knl_Queue_Object__table__R */
    ((CT__ti_sysbios_knl_Semaphore_eventPost)0), /* ti_sysbios_knl_Semaphore_eventPost__R */
    ((CT__xdc_runtime_System_exitFxn)((xdc_Fxn)xdc_runtime_System_exitSpin__E)), /* xdc_runtime_System_exitFxn__R */
    (((xdc_runtime_Assert_Id)0) << 16 | 16), /* ti_sysbios_heaps_HeapTrack_A_doubleFree__R */
    (xdc_SizeT)0x8, /* ti_sysbios_heaps_HeapMem_reqAlign__R */
    ((CT__xdc_runtime_Startup_sfxnRts)xdc_runtime_Startup_sfxnRts__A), /* xdc_runtime_Startup_sfxnRts__R */
    {
        (xdc_CPtr)-1, /* fxnTab */
        &ti_sysbios_knl_Semaphore_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_knl_Semaphore___S1) - sizeof(ti_sysbios_knl_Semaphore_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_knl_Semaphore_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_knl_Semaphore_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_knl_Semaphore_Params), /* prmsSize */
    }, /* ti_sysbios_knl_Semaphore_Object__DESC__R */
    {
        (xdc_CPtr)&ti_sysbios_gates_GateHwi_Module__FXNS__C, /* fxnTab */
        &ti_sysbios_gates_GateHwi_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_gates_GateHwi___S1) - sizeof(ti_sysbios_gates_GateHwi_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_gates_GateHwi_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_gates_GateHwi_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_gates_GateHwi_Params), /* prmsSize */
    }, /* ti_sysbios_gates_GateHwi_Object__DESC__R */
    ((CT__xdc_runtime_SysCallback_putchFxn)((xdc_Fxn)xdc_runtime_SysCallback_defaultPutch)), /* xdc_runtime_SysCallback_putchFxn__R */
    0, /* ti_sysbios_heaps_HeapMem_Object__count__R */
    (xdc_UInt)0x0, /* ti_sysbios_family_arm_m3_Hwi_numSparseInterrupts__R */
    (xdc_UInt)0x8, /* ti_sysbios_knl_Mailbox_maxTypeAlign__R */
    1, /* ti_sysbios_family_arm_cc26xx_TimestampProvider_useClockTimer__R */
    offsetof(ti_sysbios_knl_Event_Object__,Object_field_pendQ), /* ti_sysbios_knl_Event_Instance_State_pendQ__O */
    ((CT__ti_sysbios_knl_Task_allBlockedFunc)0), /* ti_sysbios_knl_Task_allBlockedFunc__R */
    (((xdc_runtime_Error_Id)19) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_hardFault__R */
    0, /* ti_sysbios_knl_Mailbox_Object__count__R */
    "{static-instance-name}", /* xdc_runtime_Text_nameStatic__R */
    (((xdc_runtime_Error_Id)24) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_debugMon__R */
    (((xdc_runtime_Error_Id)23) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_svCall__R */
    offsetof(ti_sysbios_knl_Clock_Module_State__,Object_field_clockQ), /* ti_sysbios_knl_Clock_Module_State_clockQ__O */
    ((CT__xdc_runtime_SysCallback_readyFxn)((xdc_Fxn)xdc_runtime_SysCallback_defaultReady)), /* xdc_runtime_SysCallback_readyFxn__R */
    (xdc_UInt16)0x4000, /* xdc_runtime_Text_unnamedModsLastId__R */
    (xdc_SizeT)0x200, /* ti_sysbios_knl_Task_defaultStackSize__R */
    {&xdc_runtime_IModule_Interface__BASE__C}, /* xdc_runtime_IGateProvider_Interface__BASE__R */
    (((xdc_runtime_Error_Id)15) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_hwiLimitExceeded__R */
    ((CT__xdc_runtime_Startup_startModsFxn)((xdc_Fxn)xdc_runtime_Startup_startMods__I)), /* xdc_runtime_Startup_startModsFxn__R */
    offsetof(ti_sysbios_knl_Semaphore_Object__,Object_field_pendQ), /* ti_sysbios_knl_Semaphore_Instance_State_pendQ__O */
    ((CT__xdc_runtime_System_extendFxn)((xdc_Fxn)xdc_runtime_System_printfExtend__I)), /* xdc_runtime_System_extendFxn__R */
    {
        (xdc_CPtr)0, /* fxnTab */
        &ti_sysbios_family_arm_m3_Hwi_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_family_arm_m3_Hwi___S1) - sizeof(ti_sysbios_family_arm_m3_Hwi_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_family_arm_m3_Hwi_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_family_arm_m3_Hwi_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_family_arm_m3_Hwi_Params), /* prmsSize */
    }, /* ti_sysbios_family_arm_m3_Hwi_Object__DESC__R */
    "{empty-instance-name}", /* xdc_runtime_Text_nameEmpty__R */
    1, /* ti_sysbios_family_arm_m3_Hwi_Object__count__R */
    ((CT__xdc_runtime_Text_visitRopeFxn)((xdc_Fxn)xdc_runtime_Text_visitRope__I)), /* xdc_runtime_Text_visitRopeFxn__R */
    ((CT__xdc_runtime_SysCallback_abortFxn)((xdc_Fxn)xdc_runtime_SysCallback_defaultAbort)), /* xdc_runtime_SysCallback_abortFxn__R */
    0, /* ti_sysbios_knl_Task_defaultStackHeap__R */
    (((xdc_runtime_Error_Id)22) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_usageFault__R */
    (xdc_UInt32)0x200, /* ti_sysbios_family_arm_m3_Hwi_ccr__R */
    (xdc_Bits16)0x2e, /* ti_sysbios_heaps_HeapTrack_Module__id__R */
    (((xdc_runtime_Error_Id)34) << 16 | 0), /* ti_sysbios_heaps_HeapMem_E_memory__R */
    (((xdc_runtime_Error_Id)20) << 16 | 0), /* ti_sysbios_family_arm_m3_Hwi_E_memFault__R */
    1, /* ti_sysbios_knl_Task_Object__count__R */
    {
        (xdc_CPtr)&ti_sysbios_heaps_HeapMem_Module__FXNS__C, /* fxnTab */
        &ti_sysbios_heaps_HeapMem_Module__root__V.link, /* modLink */
        sizeof(ti_sysbios_heaps_HeapMem___S1) - sizeof(ti_sysbios_heaps_HeapMem_Object2__), /* objAlign */
        0, /* objHeap */
        0, /* objName */
        sizeof(ti_sysbios_heaps_HeapMem_Object2__), /* objSize */
        (xdc_CPtr)&ti_sysbios_heaps_HeapMem_Object__PARAMS__C, /* prmsInit */
        sizeof(ti_sysbios_heaps_HeapMem_Params), /* prmsSize */
    }, /* ti_sysbios_heaps_HeapMem_Object__DESC__R */
    "{unknown-instance-name}", /* xdc_runtime_Text_nameUnknown__R */
    (xdc_runtime_IHeap_Handle)&ti_sysbios_heaps_HeapCallback_Object__table__V[0], /* xdc_runtime_Memory_defaultHeapInstance__R */
    offsetof(ti_sysbios_knl_Mailbox_Object__,Object_field_freeQue), /* ti_sysbios_knl_Mailbox_Instance_State_freeQue__O */
    ((CT__xdc_runtime_Startup_sfxnTab)xdc_runtime_Startup_sfxnTab__A), /* xdc_runtime_Startup_sfxnTab__R */
};

/* ROM_stateStruct */
#ifdef __ti__sect
#pragma DATA_SECTION(ROM_stateStruct, ".data:ROM_stateStruct");
#endif
#ifdef __GNUC__
#ifndef __TI_COMPILER_VERSION__
__FAR__ TROM__stateStruct ROM_stateStruct __attribute__ ((section(".data_ROM_stateStruct")));
#endif
#endif
#if defined (__IAR_SYSTEMS_ICC__)
#pragma location = ".data_ROM_stateStruct"
#endif
__FAR__ TROM__stateStruct ROM_stateStruct = {
    {
        (xdc_UInt32)0x0,  /* ticks */
        (xdc_UInt)0x0,  /* swiCount */
        (ti_sysbios_knl_Clock_TimerProxy_Handle)&ti_sysbios_family_arm_cc26xx_Timer_Object__table__V[0],  /* timer */
        (ti_sysbios_knl_Swi_Handle)&ti_sysbios_knl_Swi_Object__table__V[0],  /* swi */
        (xdc_UInt)0x1,  /* numTickSkip */
        (xdc_UInt32)0x1,  /* nextScheduledTick */
        (xdc_UInt32)0x0,  /* maxSkippable */
        0,  /* inWorkFunc */
        0,  /* startDuringWorkFunc */
        0,  /* ticking */
        {
            {
                ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_knl_Clock_Object__table__V[0].elem)),  /* next */
                ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_knl_Clock_Object__table__V[0].elem)),  /* prev */
            },  /* elem */
        },  /* Object_field_clockQ */
    }, /* ti_sysbios_knl_Clock_Module__state__V */
    {
        0,  /* timer */
    }, /* ti_sysbios_family_arm_cc26xx_TimestampProvider_Module__state__V */
    {
        ((xdc_Int*)0),  /* stateTab */
        0,  /* execFlag */
        0,  /* rtsDoneFlag */
    }, /* xdc_runtime_Startup_Module__state__V */
    {
        ((xdc_runtime_Types_RegDesc*)0),  /* listHead */
        (xdc_Bits16)0x7fff,  /* curId */
    }, /* xdc_runtime_Registry_Module__state__V */
    {
        {
            (xdc_Bits32)0x0,  /* hi */
            (xdc_Bits32)0x2dc6c00,  /* lo */
        },  /* cpuFreq */
        (xdc_UInt)0x0,  /* rtsGateCount */
        ((xdc_IArg)(0x0)),  /* rtsGateKey */
        (ti_sysbios_BIOS_RtsGateProxy_Handle)&ti_sysbios_gates_GateMutex_Object__table__V[1],  /* rtsGate */
        ti_sysbios_BIOS_ThreadType_Main,  /* threadType */
        ((void*)0),  /* smpThreadType */
        ((xdc_Void(*)(xdc_Void))((xdc_Fxn)ti_sysbios_BIOS_startFunc)),  /* startFunc */
        ((xdc_Void(*)(xdc_Int))((xdc_Fxn)ti_sysbios_BIOS_exitFunc)),  /* exitFunc */
    }, /* ti_sysbios_BIOS_Module__state__V */
    {
        1,  /* locked */
        (xdc_UInt)0x0,  /* curSet */
        (xdc_UInt)0x0,  /* curTrigger */
        0,  /* curSwi */
        0,  /* curQ */
        ((void*)ti_sysbios_knl_Swi_Module_State_0_readyQ__A),  /* readyQ */
        ((void*)0),  /* constructedSwis */
    }, /* ti_sysbios_knl_Swi_Module__state__V */
    {
        1,  /* locked */
        (xdc_UInt)0x0,  /* curSet */
        0,  /* workFlag */
        (xdc_UInt)0x1,  /* vitalTasks */
        0,  /* curTask */
        0,  /* curQ */
        ((void*)ti_sysbios_knl_Task_Module_State_0_readyQ__A),  /* readyQ */
        ((void*)0),  /* smpCurSet */
        ((void*)0),  /* smpCurMask */
        ((void*)0),  /* smpCurTask */
        ((void*)0),  /* smpReadyQ */
        ((void*)ti_sysbios_knl_Task_Module_State_0_idleTask__A),  /* idleTask */
        ((void*)0),  /* constructedTasks */
        {
            {
                ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_knl_Task_Module__state__V.Object_field_inactiveQ.elem)),  /* next */
                ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_knl_Task_Module__state__V.Object_field_inactiveQ.elem)),  /* prev */
            },  /* elem */
        },  /* Object_field_inactiveQ */
        {
            {
                ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_knl_Task_Module__state__V.Object_field_terminatedQ.elem)),  /* next */
                ((ti_sysbios_knl_Queue_Elem*)((void*)&ti_sysbios_knl_Task_Module__state__V.Object_field_terminatedQ.elem)),  /* prev */
            },  /* elem */
        },  /* Object_field_terminatedQ */
    }, /* ti_sysbios_knl_Task_Module__state__V */
    {
        (xdc_SizeT)0x8,  /* maxDefaultTypeAlign */
    }, /* xdc_runtime_Memory_Module__state__V */
    {
        ((void*)0),  /* atexitHandlers */
        (xdc_Int)0x0,  /* numAtexitHandlers */
    }, /* xdc_runtime_System_Module__state__V */
    {
        ((xdc_Char*)0),  /* taskSP */
        ((void*)ti_sysbios_family_arm_m3_Hwi_Module_State_0_excActive__A),  /* excActive */
        ((void*)ti_sysbios_family_arm_m3_Hwi_Module_State_0_excContext__A),  /* excContext */
        ((void*)ti_sysbios_family_arm_m3_Hwi_Module_State_0_excStack__A),  /* excStack */
        ((xdc_Ptr)0),  /* isrStack */
        ((xdc_Ptr)0),  /* isrStackBase */
        ((xdc_Ptr)0),  /* isrStackSize */
        ((xdc_Ptr)(0x20000000)),  /* vectorTableBase */
        (xdc_UInt)0x101,  /* swiTaskKeys */
        ((xdc_Ptr)((void*)&ti_sysbios_family_arm_m3_Hwi_dispatchTable[0])),  /* dispatchTable */
        0,  /* vnvicFlushRequired */
        ((void*)0),  /* intAffinity */
        ((void*)0),  /* intAffinityMasks */
    }, /* ti_sysbios_family_arm_m3_Hwi_Module__state__V */
    {
        (xdc_UInt)0x0,  /* availMask */
        (ti_sysbios_family_arm_cc26xx_Timer_Handle)&ti_sysbios_family_arm_cc26xx_Timer_Object__table__V[0],  /* handle */
    }, /* ti_sysbios_family_arm_cc26xx_Timer_Module__state__V */
};

/* xdcRomConstPtr */
#ifdef __ti__sect
#pragma DATA_SECTION(xdcRomConstPtr, ".data:xdcRomConstPtr");
#endif
#ifdef __GNUC__
#ifndef __TI_COMPILER_VERSION__
const xdc_UInt8 * xdcRomConstPtr __attribute__ ((section(".data_xdcRomConstPtr")));
#endif
#endif
#if defined (__IAR_SYSTEMS_ICC__)
#pragma location = ".data_xdcRomConstPtr"
#endif
const xdc_UInt8 * xdcRomConstPtr = (xdc_UInt8 *)&ROM_constStruct;

